ElementalMFG/ecosystem/firmware/sdkconfig.defaults
# SPDX-License-Identifier: Apache-2.0
# SS-SP Lite (ESP32-S3-WROOM-1-N16R8) build defaults.
# See 01_SS-SP_LITE_HARDWARE_REFERENCE.md §4.1.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, custom A/B OTA partition table ---------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 8 MB Octal @ 80 MHz ---------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# --- Console on native USB-Serial-JTAG (frees UART1/UART2 for modules) ------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- RTOS / performance ------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# S-02-006: explicit task-stack canary check (overflow -> canary fail -> panic;
# flash-dump post-mortem lands with S-02-008). Kept explicit even though this
# is the IDF default so the RTOS baseline is self-documenting.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# --- S-02-009: task / interrupt watchdog policy -----------------------------
# Task WDT (TWDT): a task that hangs (fails to feed within the deadline) must
# RECOVER via panic -> reboot, not merely emit a warning — a wedged pager is
# useless in the field. Hence PANIC=y (structured flash-dump post-mortem of the
# ensuing panic lands with S-02-008). The idle tasks on both cores are
# subscribed so a runaway task that starves an idle task is also caught.
# App tasks whose loop latency is bounded strictly under the 5 s deadline
# register + feed through the ss_task_wdt_* API (see ss_tasks.h WATCHDOG POLICY).
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# Interrupt WDT (IWDT): guards against ISRs / critical sections that disable
# interrupts for too long (protects ISR latency). Kept at the IDF-default
# timeout (~300 ms); only the enable + CPU1 coverage are made explicit here.
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_CHECK_CPU1=y

# --- S-02-008: panic post-mortem (coredump to flash) ------------------------
# Every panic path (fault, assert, stack canary, TWDT/IWDT expiry) writes an
# ELF core dump to the dedicated `coredump` partition, then reboots. ELF format
# so the record decodes with tools/xtensa-decode-crash.py (espcoredump under
# the hood). CRC32 integrity (SHA256 costs more panic-path stack for no
# security benefit here — the dump is integrity-, not authenticity-checked).
# A dedicated coredump stack is mandatory: a primary panic source IS stack
# overflow, so dumping on the faulting task's stack would corrupt the evidence
# and can wedge the dump writer.
# Dump-content hygiene contract: see firmware/main/ss_panic_guard.h.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_STACK_SIZE=2048
# Security-relevant default pinned EXPLICITLY (ss_panic_guard.h hygiene
# contract): DRAM capture stays OFF so .data/.bss/heap — i.e. every live
# secret — never lands in the dump. Flipping this needs wg-security sign-off.
CONFIG_ESP_COREDUMP_CAPTURE_DRAM=n

# --- Production hardening (enable on release builds; see EPIC-08) -----------
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
